In [1]:
import pandas as pd
dados = pd.read_csv("FIFA19.csv")

In [2]:
dados["total"] = dados["Acceleration"] + dados["Agility"] + dados["Reactions"]

In [ ]:
dados

In [ ]:
dados.sort_values("total")

In [5]:
dados = dados[["Name", "total"]]
dados.sort_values("total", ascending = False)

               Name  total
2         Neymar Jr  284.0
5         E. Hazard  279.0
0          L. Messi  277.0
26         M. Salah  276.0
60      R. Sterling  275.0
...             ...    ...
17808    A. Czaplak   77.0
17747  J. Brendieck   77.0
18138    J. Livesey   76.0
18067    N. Stephan   74.0
17625     Lee Yunoh   71.0

[18147 rows x 2 columns]

In [6]:
dados.head()

                Name  total
0           L. Messi  277.0
1  Cristiano Ronaldo  272.0
2          Neymar Jr  284.0
3             De Gea  207.0
4       K. De Bruyne  248.0

In [8]:
dados.to_csv("dados1.csv", index= False)